Revit 2026 API

# ExportIFCCategoryKeyCategoryName Property

---

The Revit category name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string CategoryName { get; set; }
```
```vb
Public Property CategoryName As String
	Get
	Set
```
```cpp
public:
property String^ CategoryName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member CategoryName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ExportIFCCategoryKey Class

Autodesk.Revit.DB Namespace